{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-System",
    "2": "B-Organization",
    "3": "I-Organization",
    "4": "B-Vulnerability",
    "5": "I-Vulnerability",
    "6": "B-Malware",
    "7": "B-Indicator",
    "8": "I-System",
    "9": "I-Indicator",
    "10": "I-Malware"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-Indicator": 7,
    "B-Malware": 6,
    "B-Organization": 2,
    "B-System": 1,
    "B-Vulnerability": 4,
    "I-Indicator": 9,
    "I-Malware": 10,
    "I-Organization": 3,
    "I-System": 8,
    "I-Vulnerability": 5,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
