{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-TIME",
    "2": "I-TIME",
    "3": "B-LOC",
    "4": "B-SECTEAM",
    "5": "I-SECTEAM",
    "6": "B-TOOL",
    "7": "B-IDTY",
    "8": "I-IDTY",
    "9": "B-MAL",
    "10": "B-APT",
    "11": "I-APT",
    "12": "I-TOOL",
    "13": "B-VULNAME",
    "14": "B-VULID",
    "15": "I-LOC",
    "16": "B-ENCR",
    "17": "B-FILE",
    "18": "B-SHA2",
    "19": "B-URL",
    "20": "B-IP",
    "21": "PROT",
    "22": "B-ACT",
    "23": "I-ACT",
    "24": "B-MD5",
    "25": "I-FILE",
    "26": "B-DOM",
    "27": "I-MAL",
    "28": "B-OS",
    "29": "B-SHA1",
    "30": "I-URL",
    "31": "I-IP",
    "32": "I-SHA2",
    "33": "I-OS",
    "34": "B-PROT",
    "35": "I-VULNAME",
    "36": "I-PROT",
    "37": "B-EMAIL",
    "38": "I-EMAIL",
    "39": "I-ENCR"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_31": 31,
    "LABEL_32": 32,
    "LABEL_33": 33,
    "LABEL_34": 34,
    "LABEL_35": 35,
    "LABEL_36": 36,
    "LABEL_37": 37,
    "LABEL_38": 38,
    "LABEL_39": 39,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
